In [3]:
import pandas as pd
import regex as re

In [4]:
# pd.read_csv('data/response.tsv', sep='\t')
data = pd.read_csv('data/response.tsv', sep='\t', header=0)

In [5]:
data.head()

,StartDate,Progress,Duration (in seconds),Finished,Q21,Q22,Q23,Q24,Q25,Q26,...,589,590,591,592,593,594,595,596,597,598
0,2022-03-23 23:33:16,100,255,True,26-30,Male,Bachelor's degree,Employee,Agree,Neither agree nor disagree,...,NaN,NaN,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN
1,2022-03-23 23:33:06,100,558,True,31-40,Female,Bachelor's degree,Employee,Strongly agree,Agree,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2022-03-23 23:33:13,100,662,True,18-25,Male,High school graduate with diploma,Self-employed,Agree,Agree,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2022-03-24 0:05:10,100,535,True,41-50,Male,Bachelor's degree,Employee,Strongly agree,Disagree,...,NaN,NaN,4.0,NaN,NaN,NaN,2.0,NaN,2.0,NaN
4,2022-03-24 0:21:15,100,247,True,41-50,Male,Master's degree,Employee,Agree,Strongly agree,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
vars_keep = ['StartDate','Progress','Duration (in seconds)','Finished','Q21','Q22','Q23','Q24','Q25','Q26','Q28','Q29','Q30','Q31','Q617','Q621','Q620','Q622','Q623','Q615','Q616']

vars_melt = ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24','25','26','27','28','29','30','31','32','33','34','35','36','37','38','39','40','41','42','43','44','45','46','47','48','49','50','51','52','53','54','55','56','57','58','59','60','61','62','63','64','65','66','67','68','69','70','71','72','73','74','75','76','77','78','79','80','81','82','83','84','85','86','87','88','89','90','91','92','93','94','95','96','97','98','99','100','101','102','103','104','105','106','107','108','109','110','111','112','113','114','115','116','117','118','119','120','121','122','123','124','125','126','127','128','129','130','131','132','133','134','135','136','137','138','139','140','141','142','143','144','145','146','147','148','149','150','151','152','153','154','155','156','157','158','159','160','161','162','163','164','165','166','167','168','169','170','171','172','173','174','175','176','177','178','179','180','181','182','183','184','185','186','187','188','189','190','191','192','193','194','195','196','197','198','199','200','201','202','203','204','205','206','207','208','209','210','211','212','213','214','215','216','217','218','219','220','221','222','223','224','225','226','227','228','229','230','231','232','233','234','235','236','237','238','239','240','241','242','243','244','245','246','247','248','249','250','251','252','253','254','255','256','257','258','259','260','261','262','263','264','265','266','267','268','269','270','271','272','273','274','275','276','277','278','279','280','281','282','283','284','285','286','287','288','289','290','291','292','293','294','295','296','297','298','299','300','301','302','303','304','305','306','307','308','309','310','311','312','313','314','315','316','317','318','319','320','321','322','323','324','325','326','327','328','329','330','331','332','333','334','335','336','337','338','339','340','341','342','343','344','345','346','347','348','349','350','351','352','353','354','355','356','357','358','359','360','361','362','363','364','365','366','367','368','369','370','371','372','373','374','375','376','377','378','379','380','381','382','383','384','385','386','387','388','389','390','391','392','393','394','395','396','397','398','399','400','401','402','403','404','405','406','407','408','409','410','411','412','413','414','415','416','417','418','419','420','421','422','423','424','425','426','427','428','429','430','431','432','433','434','435','436','437','438','439','440','441','442','443','444','445','446','447','448','449','450','451','452','453','454','455','456','457','458','459','460','461','462','463','464','465','466','467','468','469','470','471','472','473','474','475','476','477','478','479','480','481','482','483','484','485','486','487','488','489','490','491','492','493','494','495','496','497','498','499','500','501','502','503','504','505','506','507','508','509','510','511','512','513','514','515','516','517','518','519','520','521','522','523','524','525','526','527','528','529','530','531','532','533','534','535','536','537','538','539','540','541','542','543','544','545','546','547','548','549','550','551','552','553','554','555','556','557','558','559','560','561','562','563','564','565','566','567','568','569','570','571','572','573','574','575','576','577','578','579','580','581','582','583','584','585','586','587','588','589','590','591','592','593','594','595','596','597','598']

In [7]:
df_unpivot = pd.melt(data, id_vars=vars_keep, value_vars=vars_melt)

In [8]:
print(len(df_unpivot))
df_unpivot.head()

282854

,StartDate,Progress,Duration (in seconds),Finished,Q21,Q22,Q23,Q24,Q25,Q26,...,Q31,Q617,Q621,Q620,Q622,Q623,Q615,Q616,variable,value
0,2022-03-23 23:33:16,100,255,True,26-30,Male,Bachelor's degree,Employee,Agree,Neither agree nor disagree,...,Somewhat concerned,I understand,3,3,5,4,4,3,1,NaN
1,2022-03-23 23:33:06,100,558,True,31-40,Female,Bachelor's degree,Employee,Strongly agree,Agree,...,Somewhat concerned,I understand,1,2,2,3,1,1,1,NaN
2,2022-03-23 23:33:13,100,662,True,18-25,Male,High school graduate with diploma,Self-employed,Agree,Agree,...,Very concerned,I understand,4,3,4,4,3,2,1,NaN
3,2022-03-24 0:05:10,100,535,True,41-50,Male,Bachelor's degree,Employee,Strongly agree,Disagree,...,A little concerned,I understand,1,4,3,3,2,1,1,NaN
4,2022-03-24 0:21:15,100,247,True,41-50,Male,Master's degree,Employee,Agree,Strongly agree,...,Very concerned,I understand,2,2,5,4,4,2,1,NaN

In [9]:
df_unpivot_comp = df_unpivot.loc[df_unpivot['value'] >= 1]

In [10]:
len(df_unpivot_comp)

9426

In [11]:
df_unpivot_comp.head(2)

,StartDate,Progress,Duration (in seconds),Finished,Q21,Q22,Q23,Q24,Q25,Q26,...,Q31,Q617,Q621,Q620,Q622,Q623,Q615,Q616,variable,value
25,2022-04-05 23:47:34,100,672,True,41-50,Male,Master's degree,Employee,Strongly agree,Agree,...,Very concerned,I understand,3,4,2,5,3,2,1,4.0
40,2022-04-06 2:43:23,100,152,True,26-30,Female,Bachelor's degree,Employee,Strongly agree,Agree,...,Very concerned,I understand,4,5,5,4,3,5,1,3.0

In [12]:
id_tweet = pd.read_csv('data/id_tweet.tsv', sep='\t', header=0)

In [13]:
clean_tweets=[]
tweets = id_tweet['tweet'].values.tolist()
for tweet in tweets:
    temp_tweet = re.sub('( @\w+|@\w+)', '', tweet)

    clean_tweets.append(re.sub('[^A-Za-z0-9\',\. ]+',"",temp_tweet))


id_tweet['tweet'] = clean_tweets

In [14]:
df_unpivot_comp['variable']=df_unpivot_comp['variable'].astype(int)
id_tweet['id']=id_tweet['id'].astype(int)
id_tweet

/home/ec2-user/anaconda3/envs/pytorch_p36/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

      id                                              tweet
0      1  Movie that wasn't long enough ZOLA Movie that ...
1      2  if we are taking that deleted scene as canon, ...
2      3  hobi baby is going to wake up to three posts w...
3      4   Dont fight me I have a heart problemIm only m...
4      5   LMFHAODOSO NOOOOOO i explained it to him and ...
..   ...                                                ...
593  594   We need a bout. Clifford should go with Bortu...
594  595  I realized that we have a school system right ...
595  596   Read my previous tweets about teachers Ive of...
596  597   Ah cool. My parents are Central American but ...
597  598   Depends where you live  we're in central Toky...

[598 rows x 2 columns]

In [15]:
with_tweet = pd.merge(df_unpivot_comp, id_tweet, how='left', left_on = 'variable', right_on = 'id')

In [16]:
with_tweet.head()

,StartDate,Progress,Duration (in seconds),Finished,Q21,Q22,Q23,Q24,Q25,Q26,...,Q621,Q620,Q622,Q623,Q615,Q616,variable,value,id,tweet
0,2022-04-05 23:47:34,100,672,True,41-50,Male,Master's degree,Employee,Strongly agree,Agree,...,3,4,2,5,3,2,1,4.0,1,Movie that wasn't long enough ZOLA Movie that ...
1,2022-04-06 2:43:23,100,152,True,26-30,Female,Bachelor's degree,Employee,Strongly agree,Agree,...,4,5,5,4,3,5,1,3.0,1,Movie that wasn't long enough ZOLA Movie that ...
2,2022-04-08 16:49:42,100,397,True,Above 60 years old,Male,Bachelor's degree,Unable to work,Strongly agree,Neither agree nor disagree,...,3,3,5,5,1,3,1,5.0,1,Movie that wasn't long enough ZOLA Movie that ...
3,2022-04-10 23:13:55,100,206,True,41-50,Male,Bachelor's degree,Employee,Strongly agree,Strongly agree,...,4,5,3,2,2,3,1,4.0,1,Movie that wasn't long enough ZOLA Movie that ...
4,2022-04-28 2:13:35,100,432,True,18-25,Female,Associate degree,Employee,Neither agree nor disagree,Agree,...,2,3,3,4,1,1,1,2.0,1,Movie that wasn't long enough ZOLA Movie that ...

In [18]:
final_data = with_tweet[['Q21','Q22','Q23','Q24','Q25','Q26','Q28','Q29','Q30','Q31','tweet','value']]
train_data = final_data[['Q21','Q22','Q23','Q24','Q25','Q26','Q28','Q29','Q30','Q31','tweet','value']][:7002]
test_data = final_data[['Q21','Q22','Q23','Q24','Q25','Q26','Q28','Q29','Q30','Q31','tweet','value']][7002:]

In [19]:
print(len(train_data))
print(len(test_data))

7002
2424

In [20]:
train_data.to_csv('data/train_data_full.csv')
test_data.to_csv('data/test_data_full.csv')